In [ ]:
# Persiapan membuat data
import pandas as pd
import random
 
pelajaran = ['Matematika', 'Fisika', 'Biologi', 'Kimia', 'Geologi', 'Ekonomi']
kelas = ['12A', '12B', '12C', '12D']
 
hasil_nilai = {
    'siswa_id' : range(1, 21),
    'pelajaran' : [random.choice(pelajaran) for i in range(20)],
    'nilai' : [random.choice(range(0, 100)) for i in range(20)],
    'jenis-kelamin' : [random.choice(['laki-laki', 'perempuan']) for i in range(20)],
    'kelas' : [random.choice(kelas) for i in range(20)]
}
 
df = pd.DataFrame(hasil_nilai)
df.head()

   siswa_id   pelajaran  nilai jenis-kelamin kelas
0         1  Matematika     33     laki-laki   12D
1         2     Ekonomi     54     laki-laki   12B
2         3     Ekonomi     14     perempuan   12D
3         4     Geologi     13     perempuan   12A
4         5  Matematika     52     laki-laki   12A

<h2>Soal 1: Indexing</h2>

1. Lakukan indexing terhadap dataframe untuk mengakses column nilai dan kelas saja
2. Lakukan indexing terhadap dataframe untuk mengakses row 5 sampai 10 beserta column pelajaran dan nilai

In [ ]:
# code here
df[["nilai","kelas"]]

    nilai kelas
0      33   12D
1      54   12B
2      14   12D
3      13   12A
4      52   12A
5      14   12D
6      87   12D
7      59   12C
8      50   12C
9      58   12C
10     75   12B
11     11   12C
12     52   12A
13     13   12B
14     91   12D
15     28   12A
16     14   12A
17     98   12C
18      3   12B
19     38   12D

In [ ]:
df.loc[4:9,['pelajaran','nilai']]

    pelajaran  nilai
4  Matematika     52
5  Matematika     14
6     Ekonomi     87
7     Geologi     59
8      Fisika     50
9       Kimia     58

<h2>Soal 2: Filter DataFrame Dengan Boolean</h2>

1. Tampilkan semua data siswa pada mata pelajaran Ekonomi dan Fisika
2. Tampilkan semua data siswa yang mempunyai nilai lebih dari 50 di mata pelajaran Kimia 
3. Tampilkan semua data yang mempunyai nilai lebih dari 70, berjnis kelamin perempuan dan di kelas 12C

In [ ]:
# code here
Fisika = df.pelajaran == 'Fisika'
Ekonomi = df.pelajaran == 'Ekonomi'
df[(Fisika)|(Ekonomi)]

    siswa_id pelajaran  nilai jenis-kelamin kelas
1          2   Ekonomi     54     laki-laki   12B
2          3   Ekonomi     14     perempuan   12D
6          7   Ekonomi     87     laki-laki   12D
8          9    Fisika     50     perempuan   12C
11        12   Ekonomi     11     perempuan   12C
14        15   Ekonomi     91     perempuan   12D
15        16   Ekonomi     28     laki-laki   12A
18        19   Ekonomi      3     laki-laki   12B

In [ ]:
Kimia = df.pelajaran == 'Kimia'
lebih50 = df.nilai > 50
df[(lebih50)&(Kimia)]

    siswa_id pelajaran  nilai jenis-kelamin kelas
9         10     Kimia     58     perempuan   12C
12        13     Kimia     52     laki-laki   12A

In [ ]:
lebih70 = df.nilai > 70
Kelas = df.kelas == '12C'
Perempuan = df['jenis-kelamin'] == 'perempuan'
df[(lebih70)&(Kelas)&(Perempuan)]

    siswa_id   pelajaran  nilai jenis-kelamin kelas
17        18  Matematika     98     perempuan   12C

<h2>Soal 3: Data Transformation</h2>

lakukan data transformasi terhadap column 'nilai' dengan fungsi transformasi, berikut rumus dari normalisasi

![alt text](https://drive.google.com/uc?id=1wed-EbRSTA0JP1ceDp6lcKBqH2yJ4aa3)

In [ ]:
# code here
def normalized(df):
    return (df - df.min() / df.max() - df.min())
print(df[['nilai']].apply(normalized))

        nilai
0   29.969388
1   50.969388
2   10.969388
3    9.969388
4   48.969388
5   10.969388
6   83.969388
7   55.969388
8   46.969388
9   54.969388
10  71.969388
11   7.969388
12  48.969388
13   9.969388
14  87.969388
15  24.969388
16  10.969388
17  94.969388
18  -0.030612
19  34.969388